INSERT Readers (name) VALUES 
('Иван Динаев'),
('Максим Зайцев'),
('Эдуард Константинов'),
('Дмитрий Ломаев');

INSERT Publishers (name) VALUES 
('Питер'),
('Издательство 2'),
('Москва');


INSERT Authors (name) VALUES 
('Лев Толстой'),
('Федор Достоевский'),
('Александр Пушкин'),
('Иван Тургенев'),
('Николай Гоголь');


INSERT Books (name, isbn, publishYear, count, publisherId, authorId) VALUES
-- Лев Толстой
('Война и мир (1 том)', '978-5-17-124000-0', 1869, 10, '', ''),
('Анна Каренина', '978-5-17-124001-7', 1877, 6, '', ''),
('Обломов', '978-5-17-124002-4', 1859, 6, '', ''),
-- Федор Достоевский
('Преступление и наказание', '978-5-17-125000-4', 1866, 8, '', '');

INSERT LendingBooks (limitDate, returned, readerId, bookId) VALUES
('01-01-2020', 0, '', ''),
('25-01-2026', 1, '', ''),
('01-04-2026', 1, '', ''),
('20-06-2026', 0, '', '');

